Autodesk.Revit.DB.ProjectLocationSet
An set that contains project locations.

Autodesk.Revit.DB.ProjectLocationSet.Insert(Autodesk.Revit.DB.ProjectLocation)
System.Int32
Insert the specified project location into the set.
item: The project location to be inserted into the set.
Returns: Returns whether the project location was inserted into the set.

Autodesk.Revit.DB.ProjectLocationSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ProjectLocationSet.ReverseIterator
Autodesk.Revit.DB.ProjectLocationSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.ProjectLocationSet.ForwardIterator
Autodesk.Revit.DB.ProjectLocationSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ProjectLocationSet.Erase(Autodesk.Revit.DB.ProjectLocation)
System.Int32
Removes a specified project location from the set.
item: The project location to be erased.
Returns: The number of project locations that were erased from the set.

Autodesk.Revit.DB.ProjectLocationSet.Contains(Autodesk.Revit.DB.ProjectLocation)
System.Boolean
Tests for the existence of a project location within the set.
item: The project location to be searched for.
Returns: The Contains method returns True if the project location is within the set, otherwise False.

Autodesk.Revit.DB.ProjectLocationSet.Clear
void
Removes every project location from the set, rendering it empty.

Autodesk.Revit.DB.ProjectLocationSet.Size
System.Int32
get
Returns the number of project locations that are in the set.

Autodesk.Revit.DB.ProjectLocationSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.